import { supabase } from "@/supabase-client";

export const generateRandomSlug = () => {
    const characters = 'abcdefghijklmnopqrstuvwxyz1234567890';
    let result = '';
    const charactersLength = characters.length;
    for (let i = 0; i < 16; i++) {
        result += characters.charAt(Math.floor(Math.random() * charactersLength));
    }
    return result;
}



export async function checkAuthConnection() {
    try {
        // This query asks for the total count of users without fetching user data.
        // It's a very fast and low-cost operation.
        const { error } = await supabase.from('users').select('*', { count: 'exact', head: true });

        if (error) {
            console.error('Supabase auth connection error:', error.message);
            return false;
        }

        console.log('✅ Supabase connection to auth schema is good.');
        return true;

    } catch (e) {
        console.error('A network error occurred:', e.message);
        return false;
    }
}


export const exampleQuestions = [
    "תן רוטב נפוץ לסושי",
    "תני מילה נרדפת ל\"שמיים\"?",
    "ספרי במשפט אחד את הסיפור של כיפה אדומה",
    "תן שם של כוכב במערכת השמש",
    "איך מנצחים במטקות?",
    "כמה יבשות יש?",
    "מה עושים לתינוק בכרית מילה?",
    "\"אין חכם כבעל...\"?",
    "איך יודעים שאפשר להוציא עוגה מהתנור?",
    "\"אם בארזים נפלה שלהבת, מה יגידו...\"?",
    "במה הגיוני לטבול צ'יפס?",
    "איך מאייתים \"ישראל\" מהסוף להתחלה?",
    "על מה מורחים שפתון?",
    "תני שם של יחידה צבאית",
    "מה האות הראשונה במילה \"בלון\"?",
    "מה הטעם של לימון?",
    "תן דוגמה לנכס צאן ברזל ישראלי",
    "מה המילה האחרונה בתנ\"ך?",
    "איך מכינים קרח?",
    "\"עוגה עוגה עוגה, במעגל...\"?",
    "איך קוראים לאשתו של הגמל?",
    "מה אייזיק ניוטון גילה?",
    "איזו תכונה מאפיינת חמור?",
    "עם מה משקים עציצים?",
    "מה החוק השני של התרמודינמיקה?",
    "כמה צלעות יש במתומן?",
    "על מה זכתה עדה יונת בפרס נובל?",
    "מה ראשי התיבות ממ\"ד?",
    "מי זכה במונדיאל האחרון?",
    "מה השם האמיתי של ליידי גאגא?",
    "איך קוראים לחבר של אדון שוקו?",
    "מה רואים כשמסתכלים במראה?",
    "איזה מאכל חולי צליאק יכולים לאכול?",
    "מה הסלוגן של המוסד?",
    "מה ראשי התיבות או\"ם?",
    "עם איזה מכשיר מתגלחים?",
    "מה ההבדל בין ברבור לאווז?",
    "למה מחליפים מצערים?",
    "מי גילה את אמריקה?",
    "מפני מה מגן קרם הגנה?",
    "מי מכונה \"מלך החיות\"?",
    "איפה כריש חי?",
    "מה הגיוני ללבוש להלוויה?",
    "איך אומרים \"טיפש\" ביפנית?",
    "השלימי: \"תפסת מרובה...\"?",
    "מה לומדים באוניברסיטה?",
    "מה זה \"טוורקינג\"?",
    "מה מייצר הלבנה?",
    "ציין אחד משבטי ישראל",
    "ממה מכינים פלאפל?",
    "תני טעם נפוץ של ארטיק",
    "\"יום הולדת, חגיגה...\"?",
    "מה יוצא אם משפשפים מנורה?",
    "מה הטלפון של המשטרה?",
    "תן שם של זמר אופרה מפורסם",
    "לאיזה בעל חיים יש שמונה זרועות?",
    "איך קוראים לאיש שמכבה שריפות?",
    "תני סוג של אגוז",
    "מה אפשר לקנות בטמבוריה?",
    "איזה משקל הגיוני להרים עם היד?",
    "איך יודעים שבא אביב?",
    "איזה וירוס התחיל את המגפה ב-2020?",
    "\"מי שמאמין לא...\"?",
    "לאיזו חיה יש צוואר ארוך?",
    "מה לגיטימי להגיד לילד שחוגג בר מצווה?",
    "איזו עיר בירה אינה באירופה?",
    "איזו שפה מדברים בפורטוגל?",
    "איך קוראים לממציא הדינמיט?",
    "כמה ימים יש בפברואר?",
    "מה מייצרת חברת קוקה קולה?",
    "בספרי \"דמדומים\", ערפדים נלחמים ב...?",
    "איך קוראים לכלב של מיקי מאוס?",
    "האם יש חייזרים?",
    "איפה נמצאות הפירמידות?",
    "איך קוראים למשחק הקופסה הזה?",
    "תן שם של מאכל איטלקי",
    "איך אומרים \"דג\" באמהרית?",
    "מה פו הדב אוהב לאכול?",
    "מה שמים בצלחת פסח?",
    "מה יקרה אם תסתכלי ישירות לתוך השמש?",
    "כמה עולה לשחרר עגלת סופר?",
    "ולכן לשחרר שלוש עגלות סופר עולה...?",
    "ציין שם של מלון בטבריה",
    "מה גזרו לשמשון הגיבור?",
    "באיזה גיל רושמים ילד לגן חובה?",
    "באנגלית \"הלווין\" ובעברית?",
    "מה המטרה במשחק \"פקמן\"?",
    "\"מי שטרח בערב שבת...\"?",
    "מהי פעילות מהנה עם הילדים בקיץ?",
    "באיזו תנוחה נוח לישון?",
    "מה ראשי התיבות גמ\"ש?",
    "תני שיר שאנחנו שומעים בפסח",
    "איזה דגל מסמל דחייה אסורה?",
    "איזה מאכל הגיוני למצוא בסופר?",
    "מה עושים עם קוץ בטוסיק?",
    "מה זה \"פרנויה\"?",
    "איזו חיה מבין הפירות?",
    "תן דוגמה לחפץ עגול",
    "מה זה \"צ'יז\"?",
    "עם מה אוכלים מרק?",
    "איזו חיה היא הנוער?",
    "איזו פילה שווה פחות מ-30 בגופיה?",
    "מה יוצא דופן בין ריבוע, משולש ועיגול?",
    "בשם איזו מדינה יש את האות י'?",
    "אם אני עומד מצד ימין שלך, באיזה צד שלי אתה עומד?",
    "מה גורם למגנטים להתנגד?",
    "מה לא עושים בצום?",
    "תן מדינה שאין לה גבול ימי",
    "תדגימי בדיאלקט",
    "למה אסור לחלק באפס?",
    "ספר במשפט את עלילת \"פטר והזאב\"",
    "מה ראשי התיבות פוצ\"ח?",
    "מה בונים בונים?",
    "איזה גוזל יוצא מהאף?",
    "איזה סגנון מוזיקה מתאים לריקוד עם?",
    "איך קוראים לראש ממשלת סלובקיה?",
    "מה היה תחום ההתמחות של זיגמונד פרויד?",
    "מי זכתה לפני 3 שנים בליגת האלופות?",
    "שלב את המילה \"ארטישוק\" במשפט",
    "מאיזו מדינה הגיע הבורשט?",
    "תני שם של אויב של באטמן",
    "באיזה שם של מדינה יש את האות א'?",
    "מה עושים באמבולנס?",
    "איך הגיוני להרוג נחש?",
    "כמה פינות יש לכובע שלי?",
    "איזה מנגנון אפשר למצוא ברכב?",
    "אם מישהו הוא \"צ'ארמר\", מתכוונים שהוא...?",
    "מה השם האמיתי של \"פרינס\"?",
    "השלימי את השיר: \"יום אחד אולי אפרוש...\"?",
    "כמה גלגלים יש לרכב שאיבד גלגל אחד?",
    "תן מאכל שהגיוני להגיש לטבעוני",
    "לאיזו משפחה שייך הטווס?",
    "מה מחיר דירה ממוצעת בישראל?",
    "מה מפיקים בבנק?",
    "מה ראשי התיבות WWW?",
    "מה המספר שבא אחרי 245?",
    "תן שיר של אביב גפן",
    "איך עושה נחש?",
    "באיזה אור ברמזור עוצרים?",
    "מה זה מספר ראשוני?",
    "תני דוגמה למספר ראשוני",
    "איך נקראת הפעולה של קטיפת תמרים?",
    "למה שמים לכלבים רצועה?",
    "מה הגיוני לעשות באזכרה?",
    "למה הדברה לובשת פיג'מה?",
    "איפה נמצא מגדל אייפל?",
    "איזה גוזל יוצא מהר געש?",
    "במה עסק נתן אלתרמן?",
    "צייני דמות חשובה מסרטי מלחמת הכוכבים"
];



export const btnStyles =
    `
/* From Uiverse.io by satyamchaudharydev */
#btn {
  --bg: #a3ff00;
  --text-color: black;
  position: relative;
  width: 100%;
  curtsor:pointer
  border: none;
  background: var(--bg);
  color: var(--text-color);
  padding: 1em;
  font-weight: bold;
  text-transform: uppercase;
  transition: 0.2s;
  border-radius: 5px;
  opacity: 0.8;
  letter-spacing: 1px;
  box-shadow: #2a5c32 0px 7px 2px, #000 0px 8px 5px;
}

#btn:hover {
  opacity: 1;
}

#btn:active {
  top: 4px;
  box-shadow: #2a5c32 0px 3px 2px,#000 0px 3px 5px;
}
    `




export const btnStyles2 =
    `
#btn {
    width:90%;
  color: oklch(27.9% 0.041 260.031);
  padding: 12px;
  font-weight: bold;
  cursor: pointer;
  transition: all 0.3s ease;
  position: relative;
  display: inline-block;
  outline: none;
  border-radius: 5px;
  border: none;
  background: #80ed99;
  box-shadow: 0 7px #57cc99;
  font-size:24px;
}
#btn:hover {
  box-shadow: 0 3px #57cc99;
  top: 1px;
}
#btn:active {
  box-shadow: 0 0 #57cc99;
  top: 5px;
}
    `